import type { IReview } from '@/types/review';

export const reviews: IReview[] = [
  {
    id: '1',
    authorId: '1',
    businessId: '1',
    authorName: 'جان دو',
    rating: 5,
    title: 'خدمات عالی و راه‌حل‌های پیشرفته',
    content:
      'راهکارهای نوین تک راه‌حل‌های هوش مصنوعی پیشرفته‌ای را ارائه داد که به طور قابل توجهی فرآیندهای کسب و کار ما را بهبود بخشید. تیم آنها در طول پروژه حرفه‌ای و پاسخگو بودند.',
    date: '2023-05-15T10:30:00Z',
    verifiedPurchase: true,
    helpful: 42,
  },
  {
    id: '2',
    authorId: '1',
    businessId: '1',
    authorName: 'جین اسمیت',
    rating: 4,
    title: 'محصولات عالی، تأخیر اندک در تحویل',
    content:
      'راه‌حل‌های ابری که از راهکارهای نوین تک خریداری کردیم بسیار عالی هستند و زیرساخت ما را به شدت بهبود بخشیده‌اند. با این حال، تأخیر کمی در اجرا وجود داشت که باعث کمی ناراحتی شد.',
    date: '2023-06-02T14:45:00Z',
    verifiedPurchase: true,
    helpful: 28,
  },
  {
    id: '3',
    authorId: '1',
    businessId: '2',
    authorName: 'آلیس جانسون',
    rating: 5,
    title: 'محصولات خوشمزه و واقعاً ارگانیک',
    content:
      'ارگانیک سبز زمین بهترین محصولات ارگانیکی است که تا به حال چشیده‌ام. تعهد آنها به پایداری در هر محصول مشهود است. من به خصوص گوجه‌فرنگی‌های اصیل آنها را دوست دارم!',
    date: '2023-07-10T09:15:00Z',
    verifiedPurchase: true,
    helpful: 56,
  },
  {
    id: '4',
    authorId: '1',
    businessId: '2',
    authorName: 'محمد الفاید',
    rating: 4,
    title: 'محصولات عالی، اما بسته‌بندی می‌تواند بهبود یابد',
    content:
      'من کیفیت و طعم محصولات ارگانیک سبز زمین را دوست دارم. با این حال، فکر می‌کنم می‌توانند بسته‌بندی خود را حتی سازگارتر با محیط زیست بهبود دهند. در کل، هنوز هم شرکت عالی است!',
    date: '2023-08-05T16:20:00Z',
    verifiedPurchase: true,
    helpful: 37,
  },
];
